---
kind: method
id: M:Autodesk.Revit.DB.ReferencePointArray.Insert(Autodesk.Revit.DB.ReferencePoint,System.Int32)
source: html/40a620d1-799f-749e-42f7-f26669505496.htm
---
# Autodesk.Revit.DB.ReferencePointArray.Insert Method

## Syntax (C#)
```csharp
public virtual void Insert(
	ReferencePoint item,
	int index
)
```

## Parameters
- **item** (`Autodesk.Revit.DB.ReferencePoint`)
- **index** (`System.Int32`)